<?php
// Path: bootstrap/app.php

use Core\Application;

/*
|--------------------------------------------------------------------------
| Create The Application
|--------------------------------------------------------------------------
| يتم هنا استنساخ نواة التطبيق (Application Container) 
| التي تعمل كمركز لربط جميع الخدمات والـ Providers.
*/

$app = new Application(
    $_ENV['APP_BASE_PATH'] ?? dirname(__DIR__)
);

/*
|--------------------------------------------------------------------------
| Return The Application
|--------------------------------------------------------------------------
| يتم إرجاع الكائن للاستخدام في public/index.php أو bin/console.
*/

return $app;